zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_flash.h
// Field:    [16] BP_SEL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FEFUSECTL_BP_SEL                                      0x00010000
#define FLASH_FEFUSECTL_BP_SEL_BITN                                         16
#define FLASH_FEFUSECTL_BP_SEL_M                                    0x00010000
#define FLASH_FEFUSECTL_BP_SEL_S                                            16

// Field:     [8] EF_CLRZ
//
// Internal. Only to be used through TI provided API.
#define FLASH_FEFUSECTL_EF_CLRZ                                     0x00000100
#define FLASH_FEFUSECTL_EF_CLRZ_BITN                                         8
#define FLASH_FEFUSECTL_EF_CLRZ_M                                   0x00000100
#define FLASH_FEFUSECTL_EF_CLRZ_S                                            8

// Field:     [4] EF_TEST
//
// Internal. Only to be used through TI provided API.
#define FLASH_FEFUSECTL_EF_TEST                                     0x00000010
#define FLASH_FEFUSECTL_EF_TEST_BITN                                         4
#define FLASH_FEFUSECTL_EF_TEST_M                                   0x00000010
#define FLASH_FEFUSECTL_EF_TEST_S                                            4

// Field:   [3:0] EFUSE_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_FEFUSECTL_EFUSE_EN_W                                           4
#define FLASH_FEFUSECTL_EFUSE_EN_M                                  0x0000000F
#define FLASH_FEFUSECTL_EFUSE_EN_S                                           0

//*****************************************************************************
//
// Register: FLASH_O_FEFUSESTAT
//
//*****************************************************************************
// Field:     [0] SHIFT_DONE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FEFUSESTAT_SHIFT_DONE                                 0x00000001
#define FLASH_FEFUSESTAT_SHIFT_DONE_BITN                                     0
#define FLASH_FEFUSESTAT_SHIFT_DONE_M                               0x00000001
#define FLASH_FEFUSESTAT_SHIFT_DONE_S                                        0

//*****************************************************************************
//
// Register: FLASH_O_FEFUSEDATA
//
//*****************************************************************************
// Field:  [31:0] FEFUSEDATA
//
// Internal. Only to be used through TI provided API.
#define FLASH_FEFUSEDATA_FEFUSEDATA_W                                       32
#define FLASH_FEFUSEDATA_FEFUSEDATA_M                               0xFFFFFFFF
#define FLASH_FEFUSEDATA_FEFUSEDATA_S                                        0

//*****************************************************************************
//
// Register: FLASH_O_FSEQPMP
//
//*****************************************************************************
// Field: [27:24] TRIM_3P4
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSEQPMP_TRIM_3P4_W                                             4
#define FLASH_FSEQPMP_TRIM_3P4_M                                    0x0F000000
#define FLASH_FSEQPMP_TRIM_3P4_S                                            24

// Field: [21:20] TRIM_1P7
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSEQPMP_TRIM_1P7_W                                             2
#define FLASH_FSEQPMP_TRIM_1P7_M                                    0x00300000
#define FLASH_FSEQPMP_TRIM_1P7_S                                            20

// Field: [19:16] TRIM_0P8
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSEQPMP_TRIM_0P8_W                                             4
#define FLASH_FSEQPMP_TRIM_0P8_M                                    0x000F0000
#define FLASH_FSEQPMP_TRIM_0P8_S                                            16

// Field: [14:12] VIN_AT_X
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSEQPMP_VIN_AT_X_W                                             3
#define FLASH_FSEQPMP_VIN_AT_X_M                                    0x00007000
#define FLASH_FSEQPMP_VIN_AT_X_S                                            12

// Field:     [8] VIN_BY_PASS
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSEQPMP_VIN_BY_PASS                                   0x00000100
#define FLASH_FSEQPMP_VIN_BY_PASS_BITN                                       8
#define FLASH_FSEQPMP_VIN_BY_PASS_M                                 0x00000100
#define FLASH_FSEQPMP_VIN_BY_PASS_S                                          8

//*****************************************************************************
//
// Register: FLASH_O_FBSTROBES
//
//*****************************************************************************
// Field:    [24] ECBIT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBSTROBES_ECBIT                                       0x01000000
#define FLASH_FBSTROBES_ECBIT_BITN                                          24
#define FLASH_FBSTROBES_ECBIT_M                                     0x01000000
#define FLASH_FBSTROBES_ECBIT_S                                             24

// Field:    [18] RWAIT2_FLCLK
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBSTROBES_RWAIT2_FLCLK                                0x00040000
#define FLASH_FBSTROBES_RWAIT2_FLCLK_BITN                                   18
#define FLASH_FBSTROBES_RWAIT2_FLCLK_M                              0x00040000
#define FLASH_FBSTROBES_RWAIT2_FLCLK_S                                      18

// Field:    [17] RWAIT_FLCLK
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBSTROBES_RWAIT_FLCLK                                 0x00020000
#define FLASH_FBSTROBES_RWAIT_FLCLK_BITN                                    17
#define FLASH_FBSTROBES_RWAIT_FLCLK_M                               0x00020000
#define FLASH_FBSTROBES_RWAIT_FLCLK_S                                       17

// Field:    [16] FLCLKEN
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBSTROBES_FLCLKEN                                     0x00010000
#define FLASH_FBSTROBES_FLCLKEN_BITN                                        16
#define FLASH_FBSTROBES_FLCLKEN_M                                   0x00010000
#define FLASH_FBSTROBES_FLCLKEN_S                                           16

