zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_flash.h
// Field: [15:12] EE_IN_MAIN
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_WRAPPER_EE_IN_MAIN_W                                      4
#define FLASH_FCFG_WRAPPER_EE_IN_MAIN_M                             0x0000F000
#define FLASH_FCFG_WRAPPER_EE_IN_MAIN_S                                     12

// Field:    [11] ROM
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_WRAPPER_ROM                                      0x00000800
#define FLASH_FCFG_WRAPPER_ROM_BITN                                         11
#define FLASH_FCFG_WRAPPER_ROM_M                                    0x00000800
#define FLASH_FCFG_WRAPPER_ROM_S                                            11

// Field:    [10] IFLUSH
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_WRAPPER_IFLUSH                                   0x00000400
#define FLASH_FCFG_WRAPPER_IFLUSH_BITN                                      10
#define FLASH_FCFG_WRAPPER_IFLUSH_M                                 0x00000400
#define FLASH_FCFG_WRAPPER_IFLUSH_S                                         10

// Field:     [9] SIL3
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_WRAPPER_SIL3                                     0x00000200
#define FLASH_FCFG_WRAPPER_SIL3_BITN                                         9
#define FLASH_FCFG_WRAPPER_SIL3_M                                   0x00000200
#define FLASH_FCFG_WRAPPER_SIL3_S                                            9

// Field:     [8] ECCA
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_WRAPPER_ECCA                                     0x00000100
#define FLASH_FCFG_WRAPPER_ECCA_BITN                                         8
#define FLASH_FCFG_WRAPPER_ECCA_M                                   0x00000100
#define FLASH_FCFG_WRAPPER_ECCA_S                                            8

// Field:   [7:6] AUTO_SUSP
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_WRAPPER_AUTO_SUSP_W                                       2
#define FLASH_FCFG_WRAPPER_AUTO_SUSP_M                              0x000000C0
#define FLASH_FCFG_WRAPPER_AUTO_SUSP_S                                       6

// Field:   [5:4] UERR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_WRAPPER_UERR_W                                            2
#define FLASH_FCFG_WRAPPER_UERR_M                                   0x00000030
#define FLASH_FCFG_WRAPPER_UERR_S                                            4

// Field:   [3:0] CPU_TYPE1
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_WRAPPER_CPU_TYPE1_W                                       4
#define FLASH_FCFG_WRAPPER_CPU_TYPE1_M                              0x0000000F
#define FLASH_FCFG_WRAPPER_CPU_TYPE1_S                                       0

//*****************************************************************************
//
// Register: FLASH_O_FCFG_BNK_TYPE
//
//*****************************************************************************
// Field: [31:28] B7_TYPE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_BNK_TYPE_B7_TYPE_W                                        4
#define FLASH_FCFG_BNK_TYPE_B7_TYPE_M                               0xF0000000
#define FLASH_FCFG_BNK_TYPE_B7_TYPE_S                                       28

// Field: [27:24] B6_TYPE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_BNK_TYPE_B6_TYPE_W                                        4
#define FLASH_FCFG_BNK_TYPE_B6_TYPE_M                               0x0F000000
#define FLASH_FCFG_BNK_TYPE_B6_TYPE_S                                       24

// Field: [23:20] B5_TYPE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_BNK_TYPE_B5_TYPE_W                                        4
#define FLASH_FCFG_BNK_TYPE_B5_TYPE_M                               0x00F00000
#define FLASH_FCFG_BNK_TYPE_B5_TYPE_S                                       20

// Field: [19:16] B4_TYPE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_BNK_TYPE_B4_TYPE_W                                        4
#define FLASH_FCFG_BNK_TYPE_B4_TYPE_M                               0x000F0000
#define FLASH_FCFG_BNK_TYPE_B4_TYPE_S                                       16

// Field: [15:12] B3_TYPE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_BNK_TYPE_B3_TYPE_W                                        4
#define FLASH_FCFG_BNK_TYPE_B3_TYPE_M                               0x0000F000
#define FLASH_FCFG_BNK_TYPE_B3_TYPE_S                                       12

// Field:  [11:8] B2_TYPE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_BNK_TYPE_B2_TYPE_W                                        4
#define FLASH_FCFG_BNK_TYPE_B2_TYPE_M                               0x00000F00
#define FLASH_FCFG_BNK_TYPE_B2_TYPE_S                                        8

// Field:   [7:4] B1_TYPE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_BNK_TYPE_B1_TYPE_W                                        4
#define FLASH_FCFG_BNK_TYPE_B1_TYPE_M                               0x000000F0
#define FLASH_FCFG_BNK_TYPE_B1_TYPE_S                                        4

// Field:   [3:0] B0_TYPE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_BNK_TYPE_B0_TYPE_W                                        4
#define FLASH_FCFG_BNK_TYPE_B0_TYPE_M                               0x0000000F
#define FLASH_FCFG_BNK_TYPE_B0_TYPE_S                                        0

//*****************************************************************************
//
// Register: FLASH_O_FCFG_B0_START
//
//*****************************************************************************
// Field: [31:28] B0_MAX_SECTOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B0_START_B0_MAX_SECTOR_W                                  4
#define FLASH_FCFG_B0_START_B0_MAX_SECTOR_M                         0xF0000000
#define FLASH_FCFG_B0_START_B0_MAX_SECTOR_S                                 28

// Field: [27:24] B0_MUX_FACTOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B0_START_B0_MUX_FACTOR_W                                  4
#define FLASH_FCFG_B0_START_B0_MUX_FACTOR_M                         0x0F000000
#define FLASH_FCFG_B0_START_B0_MUX_FACTOR_S                                 24

// Field:  [23:0] B0_START_ADDR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B0_START_B0_START_ADDR_W                                 24
#define FLASH_FCFG_B0_START_B0_START_ADDR_M                         0x00FFFFFF
#define FLASH_FCFG_B0_START_B0_START_ADDR_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FCFG_B1_START
//
//*****************************************************************************
// Field: [31:28] B1_MAX_SECTOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B1_START_B1_MAX_SECTOR_W                                  4
#define FLASH_FCFG_B1_START_B1_MAX_SECTOR_M                         0xF0000000
#define FLASH_FCFG_B1_START_B1_MAX_SECTOR_S                                 28

// Field: [27:24] B1_MUX_FACTOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B1_START_B1_MUX_FACTOR_W                                  4
#define FLASH_FCFG_B1_START_B1_MUX_FACTOR_M                         0x0F000000
#define FLASH_FCFG_B1_START_B1_MUX_FACTOR_S                                 24

// Field:  [23:0] B1_START_ADDR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B1_START_B1_START_ADDR_W                                 24
#define FLASH_FCFG_B1_START_B1_START_ADDR_M                         0x00FFFFFF
#define FLASH_FCFG_B1_START_B1_START_ADDR_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FCFG_B2_START
//
//*****************************************************************************
// Field: [31:28] B2_MAX_SECTOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B2_START_B2_MAX_SECTOR_W                                  4
#define FLASH_FCFG_B2_START_B2_MAX_SECTOR_M                         0xF0000000
#define FLASH_FCFG_B2_START_B2_MAX_SECTOR_S                                 28

// Field: [27:24] B2_MUX_FACTOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B2_START_B2_MUX_FACTOR_W                                  4
#define FLASH_FCFG_B2_START_B2_MUX_FACTOR_M                         0x0F000000
#define FLASH_FCFG_B2_START_B2_MUX_FACTOR_S                                 24

// Field:  [23:0] B2_START_ADDR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B2_START_B2_START_ADDR_W                                 24
#define FLASH_FCFG_B2_START_B2_START_ADDR_M                         0x00FFFFFF
#define FLASH_FCFG_B2_START_B2_START_ADDR_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FCFG_B3_START
//
//*****************************************************************************
// Field: [31:28] B3_MAX_SECTOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B3_START_B3_MAX_SECTOR_W                                  4
#define FLASH_FCFG_B3_START_B3_MAX_SECTOR_M                         0xF0000000
#define FLASH_FCFG_B3_START_B3_MAX_SECTOR_S                                 28

// Field: [27:24] B3_MUX_FACTOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B3_START_B3_MUX_FACTOR_W                                  4
#define FLASH_FCFG_B3_START_B3_MUX_FACTOR_M                         0x0F000000
#define FLASH_FCFG_B3_START_B3_MUX_FACTOR_S                                 24

// Field:  [23:0] B3_START_ADDR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B3_START_B3_START_ADDR_W                                 24
#define FLASH_FCFG_B3_START_B3_START_ADDR_M                         0x00FFFFFF
#define FLASH_FCFG_B3_START_B3_START_ADDR_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FCFG_B4_START
//
//*****************************************************************************
// Field: [31:28] B4_MAX_SECTOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B4_START_B4_MAX_SECTOR_W                                  4
#define FLASH_FCFG_B4_START_B4_MAX_SECTOR_M                         0xF0000000
#define FLASH_FCFG_B4_START_B4_MAX_SECTOR_S                                 28

// Field: [27:24] B4_MUX_FACTOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B4_START_B4_MUX_FACTOR_W                                  4
#define FLASH_FCFG_B4_START_B4_MUX_FACTOR_M                         0x0F000000
#define FLASH_FCFG_B4_START_B4_MUX_FACTOR_S                                 24

// Field:  [23:0] B4_START_ADDR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B4_START_B4_START_ADDR_W                                 24
#define FLASH_FCFG_B4_START_B4_START_ADDR_M                         0x00FFFFFF
#define FLASH_FCFG_B4_START_B4_START_ADDR_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FCFG_B5_START
//
//*****************************************************************************
// Field: [31:28] B5_MAX_SECTOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B5_START_B5_MAX_SECTOR_W                                  4
#define FLASH_FCFG_B5_START_B5_MAX_SECTOR_M                         0xF0000000
#define FLASH_FCFG_B5_START_B5_MAX_SECTOR_S                                 28

// Field: [27:24] B5_MUX_FACTOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B5_START_B5_MUX_FACTOR_W                                  4
#define FLASH_FCFG_B5_START_B5_MUX_FACTOR_M                         0x0F000000
#define FLASH_FCFG_B5_START_B5_MUX_FACTOR_S                                 24

// Field:  [23:0] B5_START_ADDR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B5_START_B5_START_ADDR_W                                 24
#define FLASH_FCFG_B5_START_B5_START_ADDR_M                         0x00FFFFFF
#define FLASH_FCFG_B5_START_B5_START_ADDR_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FCFG_B6_START
//
//*****************************************************************************
// Field: [31:28] B6_MAX_SECTOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B6_START_B6_MAX_SECTOR_W                                  4
#define FLASH_FCFG_B6_START_B6_MAX_SECTOR_M                         0xF0000000
#define FLASH_FCFG_B6_START_B6_MAX_SECTOR_S                                 28

// Field: [27:24] B6_MUX_FACTOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B6_START_B6_MUX_FACTOR_W                                  4
#define FLASH_FCFG_B6_START_B6_MUX_FACTOR_M                         0x0F000000
#define FLASH_FCFG_B6_START_B6_MUX_FACTOR_S                                 24

// Field:  [23:0] B6_START_ADDR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B6_START_B6_START_ADDR_W                                 24
#define FLASH_FCFG_B6_START_B6_START_ADDR_M                         0x00FFFFFF
#define FLASH_FCFG_B6_START_B6_START_ADDR_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FCFG_B7_START
//
//*****************************************************************************
// Field: [31:28] B7_MAX_SECTOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B7_START_B7_MAX_SECTOR_W                                  4
#define FLASH_FCFG_B7_START_B7_MAX_SECTOR_M                         0xF0000000
#define FLASH_FCFG_B7_START_B7_MAX_SECTOR_S                                 28

// Field: [27:24] B7_MUX_FACTOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B7_START_B7_MUX_FACTOR_W                                  4
#define FLASH_FCFG_B7_START_B7_MUX_FACTOR_M                         0x0F000000
#define FLASH_FCFG_B7_START_B7_MUX_FACTOR_S                                 24

// Field:  [23:0] B7_START_ADDR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B7_START_B7_START_ADDR_W                                 24
#define FLASH_FCFG_B7_START_B7_START_ADDR_M                         0x00FFFFFF
#define FLASH_FCFG_B7_START_B7_START_ADDR_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FCFG_B0_SSIZE0
//
//*****************************************************************************
// Field: [27:16] B0_NUM_SECTORS
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B0_SSIZE0_B0_NUM_SECTORS_W                               12
#define FLASH_FCFG_B0_SSIZE0_B0_NUM_SECTORS_M                       0x0FFF0000
#define FLASH_FCFG_B0_SSIZE0_B0_NUM_SECTORS_S                               16

// Field:   [3:0] B0_SECT_SIZE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_B0_SSIZE0_B0_SECT_SIZE_W                                  4
#define FLASH_FCFG_B0_SSIZE0_B0_SECT_SIZE_M                         0x0000000F
#define FLASH_FCFG_B0_SSIZE0_B0_SECT_SIZE_S                                  0


#endif // __FLASH__
